Microchip-MPLAB-Harmony/csp/apps/sercom/spi/spi_self_loopback_interrupt/firmware/src/packs/ATSAME54P20A_DFP/component/dwt.h
/**
 * \brief Component description for DWT
 *
 * Copyright (c) 2018 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2018-12-21T10:09:56Z */
#ifndef _SAME54_DWT_COMPONENT_H_
#define _SAME54_DWT_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR DWT                                          */
/* ************************************************************************** */

/* -------- DWT_CTRL : (DWT Offset: 0x00) (R/W 32) Control Register -------- */
#define DWT_CTRL_CYCCNTENA_Pos                _U_(0)                                               /**< (DWT_CTRL)  Position */
#define DWT_CTRL_CYCCNTENA_Msk                (_U_(0x1) << DWT_CTRL_CYCCNTENA_Pos)                 /**< (DWT_CTRL)  Mask */
#define DWT_CTRL_CYCCNTENA(value)             (DWT_CTRL_CYCCNTENA_Msk & ((value) << DWT_CTRL_CYCCNTENA_Pos))
#define DWT_CTRL_POSTPRESET_Pos               _U_(1)                                               /**< (DWT_CTRL)  Position */
#define DWT_CTRL_POSTPRESET_Msk               (_U_(0xF) << DWT_CTRL_POSTPRESET_Pos)                /**< (DWT_CTRL)  Mask */
#define DWT_CTRL_POSTPRESET(value)            (DWT_CTRL_POSTPRESET_Msk & ((value) << DWT_CTRL_POSTPRESET_Pos))
#define DWT_CTRL_POSTINIT_Pos                 _U_(5)                                               /**< (DWT_CTRL)  Position */
#define DWT_CTRL_POSTINIT_Msk                 (_U_(0xF) << DWT_CTRL_POSTINIT_Pos)                  /**< (DWT_CTRL)  Mask */
#define DWT_CTRL_POSTINIT(value)              (DWT_CTRL_POSTINIT_Msk & ((value) << DWT_CTRL_POSTINIT_Pos))
#define DWT_CTRL_CYCTAP_Pos                   _U_(9)                                               /**< (DWT_CTRL)  Position */
#define DWT_CTRL_CYCTAP_Msk                   (_U_(0x1) << DWT_CTRL_CYCTAP_Pos)                    /**< (DWT_CTRL)  Mask */
#define DWT_CTRL_CYCTAP(value)                (DWT_CTRL_CYCTAP_Msk & ((value) << DWT_CTRL_CYCTAP_Pos))
#define DWT_CTRL_SYNCTAP_Pos                  _U_(10)                                              /**< (DWT_CTRL)  Position */
#define DWT_CTRL_SYNCTAP_Msk                  (_U_(0x3) << DWT_CTRL_SYNCTAP_Pos)                   /**< (DWT_CTRL)  Mask */
#define DWT_CTRL_SYNCTAP(value)               (DWT_CTRL_SYNCTAP_Msk & ((value) << DWT_CTRL_SYNCTAP_Pos))
#define DWT_CTRL_PCSAMPLENA_Pos               _U_(12)                                              /**< (DWT_CTRL)  Position */
#define DWT_CTRL_PCSAMPLENA_Msk               (_U_(0x1) << DWT_CTRL_PCSAMPLENA_Pos)                /**< (DWT_CTRL)  Mask */
#define DWT_CTRL_PCSAMPLENA(value)            (DWT_CTRL_PCSAMPLENA_Msk & ((value) << DWT_CTRL_PCSAMPLENA_Pos))
#define DWT_CTRL_EXCTRCENA_Pos                _U_(16)                                              /**< (DWT_CTRL)  Position */
#define DWT_CTRL_EXCTRCENA_Msk                (_U_(0x1) << DWT_CTRL_EXCTRCENA_Pos)                 /**< (DWT_CTRL)  Mask */
#define DWT_CTRL_EXCTRCENA(value)             (DWT_CTRL_EXCTRCENA_Msk & ((value) << DWT_CTRL_EXCTRCENA_Pos))
#define DWT_CTRL_CPIEVTENA_Pos                _U_(17)                                              /**< (DWT_CTRL)  Position */
#define DWT_CTRL_CPIEVTENA_Msk                (_U_(0x1) << DWT_CTRL_CPIEVTENA_Pos)                 /**< (DWT_CTRL)  Mask */
#define DWT_CTRL_CPIEVTENA(value)             (DWT_CTRL_CPIEVTENA_Msk & ((value) << DWT_CTRL_CPIEVTENA_Pos))
#define DWT_CTRL_EXCEVTENA_Pos                _U_(18)                                              /**< (DWT_CTRL)  Position */
#define DWT_CTRL_EXCEVTENA_Msk                (_U_(0x1) << DWT_CTRL_EXCEVTENA_Pos)                 /**< (DWT_CTRL)  Mask */
#define DWT_CTRL_EXCEVTENA(value)             (DWT_CTRL_EXCEVTENA_Msk & ((value) << DWT_CTRL_EXCEVTENA_Pos))
#define DWT_CTRL_SLEEPEVTENA_Pos              _U_(19)                                              /**< (DWT_CTRL)  Position */
#define DWT_CTRL_SLEEPEVTENA_Msk              (_U_(0x1) << DWT_CTRL_SLEEPEVTENA_Pos)               /**< (DWT_CTRL)  Mask */
#define DWT_CTRL_SLEEPEVTENA(value)           (DWT_CTRL_SLEEPEVTENA_Msk & ((value) << DWT_CTRL_SLEEPEVTENA_Pos))
#define DWT_CTRL_LSUEVTENA_Pos                _U_(20)                                              /**< (DWT_CTRL)  Position */
#define DWT_CTRL_LSUEVTENA_Msk                (_U_(0x1) << DWT_CTRL_LSUEVTENA_Pos)                 /**< (DWT_CTRL)  Mask */
#define DWT_CTRL_LSUEVTENA(value)             (DWT_CTRL_LSUEVTENA_Msk & ((value) << DWT_CTRL_LSUEVTENA_Pos))
#define DWT_CTRL_FOLDEVTENA_Pos               _U_(21)                                              /**< (DWT_CTRL)  Position */
#define DWT_CTRL_FOLDEVTENA_Msk               (_U_(0x1) << DWT_CTRL_FOLDEVTENA_Pos)                /**< (DWT_CTRL)  Mask */
#define DWT_CTRL_FOLDEVTENA(value)            (DWT_CTRL_FOLDEVTENA_Msk & ((value) << DWT_CTRL_FOLDEVTENA_Pos))
#define DWT_CTRL_CYCEVTENA_Pos                _U_(22)                                              /**< (DWT_CTRL)  Position */
#define DWT_CTRL_CYCEVTENA_Msk                (_U_(0x1) << DWT_CTRL_CYCEVTENA_Pos)                 /**< (DWT_CTRL)  Mask */
#define DWT_CTRL_CYCEVTENA(value)             (DWT_CTRL_CYCEVTENA_Msk & ((value) << DWT_CTRL_CYCEVTENA_Pos))
#define DWT_CTRL_NOPRFCNT_Pos                 _U_(24)                                              /**< (DWT_CTRL)  Position */
#define DWT_CTRL_NOPRFCNT_Msk                 (_U_(0x1) << DWT_CTRL_NOPRFCNT_Pos)                  /**< (DWT_CTRL)  Mask */
#define DWT_CTRL_NOPRFCNT(value)              (DWT_CTRL_NOPRFCNT_Msk & ((value) << DWT_CTRL_NOPRFCNT_Pos))
#define DWT_CTRL_NOCYCCNT_Pos                 _U_(25)                                              /**< (DWT_CTRL)  Position */
#define DWT_CTRL_NOCYCCNT_Msk                 (_U_(0x1) << DWT_CTRL_NOCYCCNT_Pos)                  /**< (DWT_CTRL)  Mask */
#define DWT_CTRL_NOCYCCNT(value)              (DWT_CTRL_NOCYCCNT_Msk & ((value) << DWT_CTRL_NOCYCCNT_Pos))
#define DWT_CTRL_NOEXTTRIG_Pos                _U_(26)                                              /**< (DWT_CTRL)  Position */
#define DWT_CTRL_NOEXTTRIG_Msk                (_U_(0x1) << DWT_CTRL_NOEXTTRIG_Pos)                 /**< (DWT_CTRL)  Mask */
#define DWT_CTRL_NOEXTTRIG(value)             (DWT_CTRL_NOEXTTRIG_Msk & ((value) << DWT_CTRL_NOEXTTRIG_Pos))
#define DWT_CTRL_NOTRCPKT_Pos                 _U_(27)                                              /**< (DWT_CTRL)  Position */
#define DWT_CTRL_NOTRCPKT_Msk                 (_U_(0x1) << DWT_CTRL_NOTRCPKT_Pos)                  /**< (DWT_CTRL)  Mask */
#define DWT_CTRL_NOTRCPKT(value)              (DWT_CTRL_NOTRCPKT_Msk & ((value) << DWT_CTRL_NOTRCPKT_Pos))
#define DWT_CTRL_NUMCOMP_Pos                  _U_(28)                                              /**< (DWT_CTRL)  Position */
#define DWT_CTRL_NUMCOMP_Msk                  (_U_(0xF) << DWT_CTRL_NUMCOMP_Pos)                   /**< (DWT_CTRL)  Mask */
#define DWT_CTRL_NUMCOMP(value)               (DWT_CTRL_NUMCOMP_Msk & ((value) << DWT_CTRL_NUMCOMP_Pos))
#define DWT_CTRL_Msk                          _U_(0xFF7F1FFF)                                      /**< (DWT_CTRL) Register Mask  */


/* -------- DWT_CYCCNT : (DWT Offset: 0x04) (R/W 32) Cycle Count Register -------- */
#define DWT_CYCCNT_Msk                        _U_(0x00000000)                                      /**< (DWT_CYCCNT) Register Mask  */


/* -------- DWT_CPICNT : (DWT Offset: 0x08) (R/W 32) CPI Count Register -------- */
#define DWT_CPICNT_CPICNT_Pos                 _U_(0)                                               /**< (DWT_CPICNT)  Position */
#define DWT_CPICNT_CPICNT_Msk                 (_U_(0xFF) << DWT_CPICNT_CPICNT_Pos)                 /**< (DWT_CPICNT)  Mask */
#define DWT_CPICNT_CPICNT(value)              (DWT_CPICNT_CPICNT_Msk & ((value) << DWT_CPICNT_CPICNT_Pos))
#define DWT_CPICNT_Msk                        _U_(0x000000FF)                                      /**< (DWT_CPICNT) Register Mask  */


/* -------- DWT_EXCCNT : (DWT Offset: 0x0C) (R/W 32) Exception Overhead Count Register -------- */
#define DWT_EXCCNT_EXCCNT_Pos                 _U_(0)                                               /**< (DWT_EXCCNT)  Position */
#define DWT_EXCCNT_EXCCNT_Msk                 (_U_(0xFF) << DWT_EXCCNT_EXCCNT_Pos)                 /**< (DWT_EXCCNT)  Mask */
#define DWT_EXCCNT_EXCCNT(value)              (DWT_EXCCNT_EXCCNT_Msk & ((value) << DWT_EXCCNT_EXCCNT_Pos))
#define DWT_EXCCNT_Msk                        _U_(0x000000FF)                                      /**< (DWT_EXCCNT) Register Mask  */


/* -------- DWT_SLEEPCNT : (DWT Offset: 0x10) (R/W 32) Sleep Count Register -------- */
#define DWT_SLEEPCNT_SLEEPCNT_Pos             _U_(0)                                               /**< (DWT_SLEEPCNT)  Position */
#define DWT_SLEEPCNT_SLEEPCNT_Msk             (_U_(0xFF) << DWT_SLEEPCNT_SLEEPCNT_Pos)             /**< (DWT_SLEEPCNT)  Mask */
#define DWT_SLEEPCNT_SLEEPCNT(value)          (DWT_SLEEPCNT_SLEEPCNT_Msk & ((value) << DWT_SLEEPCNT_SLEEPCNT_Pos))
#define DWT_SLEEPCNT_Msk                      _U_(0x000000FF)                                      /**< (DWT_SLEEPCNT) Register Mask  */


/* -------- DWT_LSUCNT : (DWT Offset: 0x14) (R/W 32) LSU Count Register -------- */
#define DWT_LSUCNT_LSUCNT_Pos                 _U_(0)                                               /**< (DWT_LSUCNT)  Position */
#define DWT_LSUCNT_LSUCNT_Msk                 (_U_(0xFF) << DWT_LSUCNT_LSUCNT_Pos)                 /**< (DWT_LSUCNT)  Mask */
#define DWT_LSUCNT_LSUCNT(value)              (DWT_LSUCNT_LSUCNT_Msk & ((value) << DWT_LSUCNT_LSUCNT_Pos))
#define DWT_LSUCNT_Msk                        _U_(0x000000FF)                                      /**< (DWT_LSUCNT) Register Mask  */


