Microchip-MPLAB-Harmony/csp/apps/sercom/spi/spi_self_loopback_interrupt/firmware/src/packs/ATSAME54P20A_DFP/component/dwt.h
/* -------- DWT_FOLDCNT : (DWT Offset: 0x18) (R/W 32) Folded-instruction Count Register -------- */
#define DWT_FOLDCNT_FOLDCNT_Pos               _U_(0)                                               /**< (DWT_FOLDCNT)  Position */
#define DWT_FOLDCNT_FOLDCNT_Msk               (_U_(0xFF) << DWT_FOLDCNT_FOLDCNT_Pos)               /**< (DWT_FOLDCNT)  Mask */
#define DWT_FOLDCNT_FOLDCNT(value)            (DWT_FOLDCNT_FOLDCNT_Msk & ((value) << DWT_FOLDCNT_FOLDCNT_Pos))
#define DWT_FOLDCNT_Msk                       _U_(0x000000FF)                                      /**< (DWT_FOLDCNT) Register Mask  */


/* -------- DWT_PCSR : (DWT Offset: 0x1C) ( R/ 32) Program Counter Sample Register -------- */
#define DWT_PCSR_Msk                          _U_(0x00000000)                                      /**< (DWT_PCSR) Register Mask  */


/* -------- DWT_COMP0 : (DWT Offset: 0x20) (R/W 32) Comparator Register 0 -------- */
#define DWT_COMP0_Msk                         _U_(0x00000000)                                      /**< (DWT_COMP0) Register Mask  */


/* -------- DWT_MASK0 : (DWT Offset: 0x24) (R/W 32) Mask Register 0 -------- */
#define DWT_MASK0_MASK_Pos                    _U_(0)                                               /**< (DWT_MASK0)  Position */
#define DWT_MASK0_MASK_Msk                    (_U_(0x1F) << DWT_MASK0_MASK_Pos)                    /**< (DWT_MASK0)  Mask */
#define DWT_MASK0_MASK(value)                 (DWT_MASK0_MASK_Msk & ((value) << DWT_MASK0_MASK_Pos))
#define DWT_MASK0_Msk                         _U_(0x0000001F)                                      /**< (DWT_MASK0) Register Mask  */


/* -------- DWT_FUNCTION0 : (DWT Offset: 0x28) (R/W 32) Function Register 0 -------- */
#define DWT_FUNCTION0_FUNCTION_Pos            _U_(0)                                               /**< (DWT_FUNCTION0)  Position */
#define DWT_FUNCTION0_FUNCTION_Msk            (_U_(0xF) << DWT_FUNCTION0_FUNCTION_Pos)             /**< (DWT_FUNCTION0)  Mask */
#define DWT_FUNCTION0_FUNCTION(value)         (DWT_FUNCTION0_FUNCTION_Msk & ((value) << DWT_FUNCTION0_FUNCTION_Pos))
#define DWT_FUNCTION0_EMITRANGE_Pos           _U_(5)                                               /**< (DWT_FUNCTION0)  Position */
#define DWT_FUNCTION0_EMITRANGE_Msk           (_U_(0x1) << DWT_FUNCTION0_EMITRANGE_Pos)            /**< (DWT_FUNCTION0)  Mask */
#define DWT_FUNCTION0_EMITRANGE(value)        (DWT_FUNCTION0_EMITRANGE_Msk & ((value) << DWT_FUNCTION0_EMITRANGE_Pos))
#define DWT_FUNCTION0_CYCMATCH_Pos            _U_(7)                                               /**< (DWT_FUNCTION0)  Position */
#define DWT_FUNCTION0_CYCMATCH_Msk            (_U_(0x1) << DWT_FUNCTION0_CYCMATCH_Pos)             /**< (DWT_FUNCTION0)  Mask */
#define DWT_FUNCTION0_CYCMATCH(value)         (DWT_FUNCTION0_CYCMATCH_Msk & ((value) << DWT_FUNCTION0_CYCMATCH_Pos))
#define DWT_FUNCTION0_DATAVMATCH_Pos          _U_(8)                                               /**< (DWT_FUNCTION0)  Position */
#define DWT_FUNCTION0_DATAVMATCH_Msk          (_U_(0x1) << DWT_FUNCTION0_DATAVMATCH_Pos)           /**< (DWT_FUNCTION0)  Mask */
#define DWT_FUNCTION0_DATAVMATCH(value)       (DWT_FUNCTION0_DATAVMATCH_Msk & ((value) << DWT_FUNCTION0_DATAVMATCH_Pos))
#define DWT_FUNCTION0_LNK1ENA_Pos             _U_(9)                                               /**< (DWT_FUNCTION0)  Position */
#define DWT_FUNCTION0_LNK1ENA_Msk             (_U_(0x1) << DWT_FUNCTION0_LNK1ENA_Pos)              /**< (DWT_FUNCTION0)  Mask */
#define DWT_FUNCTION0_LNK1ENA(value)          (DWT_FUNCTION0_LNK1ENA_Msk & ((value) << DWT_FUNCTION0_LNK1ENA_Pos))
#define DWT_FUNCTION0_DATAVSIZE_Pos           _U_(10)                                              /**< (DWT_FUNCTION0)  Position */
#define DWT_FUNCTION0_DATAVSIZE_Msk           (_U_(0x3) << DWT_FUNCTION0_DATAVSIZE_Pos)            /**< (DWT_FUNCTION0)  Mask */
#define DWT_FUNCTION0_DATAVSIZE(value)        (DWT_FUNCTION0_DATAVSIZE_Msk & ((value) << DWT_FUNCTION0_DATAVSIZE_Pos))
#define DWT_FUNCTION0_DATAVADDR0_Pos          _U_(12)                                              /**< (DWT_FUNCTION0)  Position */
#define DWT_FUNCTION0_DATAVADDR0_Msk          (_U_(0xF) << DWT_FUNCTION0_DATAVADDR0_Pos)           /**< (DWT_FUNCTION0)  Mask */
#define DWT_FUNCTION0_DATAVADDR0(value)       (DWT_FUNCTION0_DATAVADDR0_Msk & ((value) << DWT_FUNCTION0_DATAVADDR0_Pos))
#define DWT_FUNCTION0_DATAVADDR1_Pos          _U_(16)                                              /**< (DWT_FUNCTION0)  Position */
#define DWT_FUNCTION0_DATAVADDR1_Msk          (_U_(0xF) << DWT_FUNCTION0_DATAVADDR1_Pos)           /**< (DWT_FUNCTION0)  Mask */
#define DWT_FUNCTION0_DATAVADDR1(value)       (DWT_FUNCTION0_DATAVADDR1_Msk & ((value) << DWT_FUNCTION0_DATAVADDR1_Pos))
#define DWT_FUNCTION0_MATCHED_Pos             _U_(24)                                              /**< (DWT_FUNCTION0)  Position */
#define DWT_FUNCTION0_MATCHED_Msk             (_U_(0x1) << DWT_FUNCTION0_MATCHED_Pos)              /**< (DWT_FUNCTION0)  Mask */
#define DWT_FUNCTION0_MATCHED(value)          (DWT_FUNCTION0_MATCHED_Msk & ((value) << DWT_FUNCTION0_MATCHED_Pos))
#define DWT_FUNCTION0_Msk                     _U_(0x010FFFAF)                                      /**< (DWT_FUNCTION0) Register Mask  */


/* -------- DWT_COMP1 : (DWT Offset: 0x30) (R/W 32) Comparator Register 1 -------- */
#define DWT_COMP1_Msk                         _U_(0x00000000)                                      /**< (DWT_COMP1) Register Mask  */


/* -------- DWT_MASK1 : (DWT Offset: 0x34) (R/W 32) Mask Register 1 -------- */
#define DWT_MASK1_MASK_Pos                    _U_(0)                                               /**< (DWT_MASK1)  Position */
#define DWT_MASK1_MASK_Msk                    (_U_(0x1F) << DWT_MASK1_MASK_Pos)                    /**< (DWT_MASK1)  Mask */
#define DWT_MASK1_MASK(value)                 (DWT_MASK1_MASK_Msk & ((value) << DWT_MASK1_MASK_Pos))
#define DWT_MASK1_Msk                         _U_(0x0000001F)                                      /**< (DWT_MASK1) Register Mask  */


/* -------- DWT_FUNCTION1 : (DWT Offset: 0x38) (R/W 32) Function Register 1 -------- */
#define DWT_FUNCTION1_FUNCTION_Pos            _U_(0)                                               /**< (DWT_FUNCTION1)  Position */
#define DWT_FUNCTION1_FUNCTION_Msk            (_U_(0xF) << DWT_FUNCTION1_FUNCTION_Pos)             /**< (DWT_FUNCTION1)  Mask */
#define DWT_FUNCTION1_FUNCTION(value)         (DWT_FUNCTION1_FUNCTION_Msk & ((value) << DWT_FUNCTION1_FUNCTION_Pos))
#define DWT_FUNCTION1_EMITRANGE_Pos           _U_(5)                                               /**< (DWT_FUNCTION1)  Position */
#define DWT_FUNCTION1_EMITRANGE_Msk           (_U_(0x1) << DWT_FUNCTION1_EMITRANGE_Pos)            /**< (DWT_FUNCTION1)  Mask */
#define DWT_FUNCTION1_EMITRANGE(value)        (DWT_FUNCTION1_EMITRANGE_Msk & ((value) << DWT_FUNCTION1_EMITRANGE_Pos))
#define DWT_FUNCTION1_CYCMATCH_Pos            _U_(7)                                               /**< (DWT_FUNCTION1)  Position */
#define DWT_FUNCTION1_CYCMATCH_Msk            (_U_(0x1) << DWT_FUNCTION1_CYCMATCH_Pos)             /**< (DWT_FUNCTION1)  Mask */
#define DWT_FUNCTION1_CYCMATCH(value)         (DWT_FUNCTION1_CYCMATCH_Msk & ((value) << DWT_FUNCTION1_CYCMATCH_Pos))
#define DWT_FUNCTION1_DATAVMATCH_Pos          _U_(8)                                               /**< (DWT_FUNCTION1)  Position */
#define DWT_FUNCTION1_DATAVMATCH_Msk          (_U_(0x1) << DWT_FUNCTION1_DATAVMATCH_Pos)           /**< (DWT_FUNCTION1)  Mask */
#define DWT_FUNCTION1_DATAVMATCH(value)       (DWT_FUNCTION1_DATAVMATCH_Msk & ((value) << DWT_FUNCTION1_DATAVMATCH_Pos))
#define DWT_FUNCTION1_LNK1ENA_Pos             _U_(9)                                               /**< (DWT_FUNCTION1)  Position */
#define DWT_FUNCTION1_LNK1ENA_Msk             (_U_(0x1) << DWT_FUNCTION1_LNK1ENA_Pos)              /**< (DWT_FUNCTION1)  Mask */
#define DWT_FUNCTION1_LNK1ENA(value)          (DWT_FUNCTION1_LNK1ENA_Msk & ((value) << DWT_FUNCTION1_LNK1ENA_Pos))
#define DWT_FUNCTION1_DATAVSIZE_Pos           _U_(10)                                              /**< (DWT_FUNCTION1)  Position */
#define DWT_FUNCTION1_DATAVSIZE_Msk           (_U_(0x3) << DWT_FUNCTION1_DATAVSIZE_Pos)            /**< (DWT_FUNCTION1)  Mask */
#define DWT_FUNCTION1_DATAVSIZE(value)        (DWT_FUNCTION1_DATAVSIZE_Msk & ((value) << DWT_FUNCTION1_DATAVSIZE_Pos))
#define DWT_FUNCTION1_DATAVADDR0_Pos          _U_(12)                                              /**< (DWT_FUNCTION1)  Position */
#define DWT_FUNCTION1_DATAVADDR0_Msk          (_U_(0xF) << DWT_FUNCTION1_DATAVADDR0_Pos)           /**< (DWT_FUNCTION1)  Mask */
#define DWT_FUNCTION1_DATAVADDR0(value)       (DWT_FUNCTION1_DATAVADDR0_Msk & ((value) << DWT_FUNCTION1_DATAVADDR0_Pos))
#define DWT_FUNCTION1_DATAVADDR1_Pos          _U_(16)                                              /**< (DWT_FUNCTION1)  Position */
#define DWT_FUNCTION1_DATAVADDR1_Msk          (_U_(0xF) << DWT_FUNCTION1_DATAVADDR1_Pos)           /**< (DWT_FUNCTION1)  Mask */
#define DWT_FUNCTION1_DATAVADDR1(value)       (DWT_FUNCTION1_DATAVADDR1_Msk & ((value) << DWT_FUNCTION1_DATAVADDR1_Pos))
#define DWT_FUNCTION1_MATCHED_Pos             _U_(24)                                              /**< (DWT_FUNCTION1)  Position */
#define DWT_FUNCTION1_MATCHED_Msk             (_U_(0x1) << DWT_FUNCTION1_MATCHED_Pos)              /**< (DWT_FUNCTION1)  Mask */
#define DWT_FUNCTION1_MATCHED(value)          (DWT_FUNCTION1_MATCHED_Msk & ((value) << DWT_FUNCTION1_MATCHED_Pos))
#define DWT_FUNCTION1_Msk                     _U_(0x010FFFAF)                                      /**< (DWT_FUNCTION1) Register Mask  */


/* -------- DWT_COMP2 : (DWT Offset: 0x40) (R/W 32) Comparator Register 2 -------- */
#define DWT_COMP2_Msk                         _U_(0x00000000)                                      /**< (DWT_COMP2) Register Mask  */


