Microchip-MPLAB-Harmony/csp/apps/sercom/spi/spi_self_loopback_interrupt/firmware/src/packs/ATSAME54P20A_DFP/component/dwt.h
/* -------- DWT_MASK2 : (DWT Offset: 0x44) (R/W 32) Mask Register 2 -------- */
#define DWT_MASK2_MASK_Pos                    _U_(0)                                               /**< (DWT_MASK2)  Position */
#define DWT_MASK2_MASK_Msk                    (_U_(0x1F) << DWT_MASK2_MASK_Pos)                    /**< (DWT_MASK2)  Mask */
#define DWT_MASK2_MASK(value)                 (DWT_MASK2_MASK_Msk & ((value) << DWT_MASK2_MASK_Pos))
#define DWT_MASK2_Msk                         _U_(0x0000001F)                                      /**< (DWT_MASK2) Register Mask  */


/* -------- DWT_FUNCTION2 : (DWT Offset: 0x48) (R/W 32) Function Register 2 -------- */
#define DWT_FUNCTION2_FUNCTION_Pos            _U_(0)                                               /**< (DWT_FUNCTION2)  Position */
#define DWT_FUNCTION2_FUNCTION_Msk            (_U_(0xF) << DWT_FUNCTION2_FUNCTION_Pos)             /**< (DWT_FUNCTION2)  Mask */
#define DWT_FUNCTION2_FUNCTION(value)         (DWT_FUNCTION2_FUNCTION_Msk & ((value) << DWT_FUNCTION2_FUNCTION_Pos))
#define DWT_FUNCTION2_EMITRANGE_Pos           _U_(5)                                               /**< (DWT_FUNCTION2)  Position */
#define DWT_FUNCTION2_EMITRANGE_Msk           (_U_(0x1) << DWT_FUNCTION2_EMITRANGE_Pos)            /**< (DWT_FUNCTION2)  Mask */
#define DWT_FUNCTION2_EMITRANGE(value)        (DWT_FUNCTION2_EMITRANGE_Msk & ((value) << DWT_FUNCTION2_EMITRANGE_Pos))
#define DWT_FUNCTION2_CYCMATCH_Pos            _U_(7)                                               /**< (DWT_FUNCTION2)  Position */
#define DWT_FUNCTION2_CYCMATCH_Msk            (_U_(0x1) << DWT_FUNCTION2_CYCMATCH_Pos)             /**< (DWT_FUNCTION2)  Mask */
#define DWT_FUNCTION2_CYCMATCH(value)         (DWT_FUNCTION2_CYCMATCH_Msk & ((value) << DWT_FUNCTION2_CYCMATCH_Pos))
#define DWT_FUNCTION2_DATAVMATCH_Pos          _U_(8)                                               /**< (DWT_FUNCTION2)  Position */
#define DWT_FUNCTION2_DATAVMATCH_Msk          (_U_(0x1) << DWT_FUNCTION2_DATAVMATCH_Pos)           /**< (DWT_FUNCTION2)  Mask */
#define DWT_FUNCTION2_DATAVMATCH(value)       (DWT_FUNCTION2_DATAVMATCH_Msk & ((value) << DWT_FUNCTION2_DATAVMATCH_Pos))
#define DWT_FUNCTION2_LNK1ENA_Pos             _U_(9)                                               /**< (DWT_FUNCTION2)  Position */
#define DWT_FUNCTION2_LNK1ENA_Msk             (_U_(0x1) << DWT_FUNCTION2_LNK1ENA_Pos)              /**< (DWT_FUNCTION2)  Mask */
#define DWT_FUNCTION2_LNK1ENA(value)          (DWT_FUNCTION2_LNK1ENA_Msk & ((value) << DWT_FUNCTION2_LNK1ENA_Pos))
#define DWT_FUNCTION2_DATAVSIZE_Pos           _U_(10)                                              /**< (DWT_FUNCTION2)  Position */
#define DWT_FUNCTION2_DATAVSIZE_Msk           (_U_(0x3) << DWT_FUNCTION2_DATAVSIZE_Pos)            /**< (DWT_FUNCTION2)  Mask */
#define DWT_FUNCTION2_DATAVSIZE(value)        (DWT_FUNCTION2_DATAVSIZE_Msk & ((value) << DWT_FUNCTION2_DATAVSIZE_Pos))
#define DWT_FUNCTION2_DATAVADDR0_Pos          _U_(12)                                              /**< (DWT_FUNCTION2)  Position */
#define DWT_FUNCTION2_DATAVADDR0_Msk          (_U_(0xF) << DWT_FUNCTION2_DATAVADDR0_Pos)           /**< (DWT_FUNCTION2)  Mask */
#define DWT_FUNCTION2_DATAVADDR0(value)       (DWT_FUNCTION2_DATAVADDR0_Msk & ((value) << DWT_FUNCTION2_DATAVADDR0_Pos))
#define DWT_FUNCTION2_DATAVADDR1_Pos          _U_(16)                                              /**< (DWT_FUNCTION2)  Position */
#define DWT_FUNCTION2_DATAVADDR1_Msk          (_U_(0xF) << DWT_FUNCTION2_DATAVADDR1_Pos)           /**< (DWT_FUNCTION2)  Mask */
#define DWT_FUNCTION2_DATAVADDR1(value)       (DWT_FUNCTION2_DATAVADDR1_Msk & ((value) << DWT_FUNCTION2_DATAVADDR1_Pos))
#define DWT_FUNCTION2_MATCHED_Pos             _U_(24)                                              /**< (DWT_FUNCTION2)  Position */
#define DWT_FUNCTION2_MATCHED_Msk             (_U_(0x1) << DWT_FUNCTION2_MATCHED_Pos)              /**< (DWT_FUNCTION2)  Mask */
#define DWT_FUNCTION2_MATCHED(value)          (DWT_FUNCTION2_MATCHED_Msk & ((value) << DWT_FUNCTION2_MATCHED_Pos))
#define DWT_FUNCTION2_Msk                     _U_(0x010FFFAF)                                      /**< (DWT_FUNCTION2) Register Mask  */


/* -------- DWT_COMP3 : (DWT Offset: 0x50) (R/W 32) Comparator Register 3 -------- */
#define DWT_COMP3_Msk                         _U_(0x00000000)                                      /**< (DWT_COMP3) Register Mask  */


/* -------- DWT_MASK3 : (DWT Offset: 0x54) (R/W 32) Mask Register 3 -------- */
#define DWT_MASK3_MASK_Pos                    _U_(0)                                               /**< (DWT_MASK3)  Position */
#define DWT_MASK3_MASK_Msk                    (_U_(0x1F) << DWT_MASK3_MASK_Pos)                    /**< (DWT_MASK3)  Mask */
#define DWT_MASK3_MASK(value)                 (DWT_MASK3_MASK_Msk & ((value) << DWT_MASK3_MASK_Pos))
#define DWT_MASK3_Msk                         _U_(0x0000001F)                                      /**< (DWT_MASK3) Register Mask  */


/* -------- DWT_FUNCTION3 : (DWT Offset: 0x58) (R/W 32) Function Register 3 -------- */
#define DWT_FUNCTION3_FUNCTION_Pos            _U_(0)                                               /**< (DWT_FUNCTION3)  Position */
#define DWT_FUNCTION3_FUNCTION_Msk            (_U_(0xF) << DWT_FUNCTION3_FUNCTION_Pos)             /**< (DWT_FUNCTION3)  Mask */
#define DWT_FUNCTION3_FUNCTION(value)         (DWT_FUNCTION3_FUNCTION_Msk & ((value) << DWT_FUNCTION3_FUNCTION_Pos))
#define DWT_FUNCTION3_EMITRANGE_Pos           _U_(5)                                               /**< (DWT_FUNCTION3)  Position */
#define DWT_FUNCTION3_EMITRANGE_Msk           (_U_(0x1) << DWT_FUNCTION3_EMITRANGE_Pos)            /**< (DWT_FUNCTION3)  Mask */
#define DWT_FUNCTION3_EMITRANGE(value)        (DWT_FUNCTION3_EMITRANGE_Msk & ((value) << DWT_FUNCTION3_EMITRANGE_Pos))
#define DWT_FUNCTION3_CYCMATCH_Pos            _U_(7)                                               /**< (DWT_FUNCTION3)  Position */
#define DWT_FUNCTION3_CYCMATCH_Msk            (_U_(0x1) << DWT_FUNCTION3_CYCMATCH_Pos)             /**< (DWT_FUNCTION3)  Mask */
#define DWT_FUNCTION3_CYCMATCH(value)         (DWT_FUNCTION3_CYCMATCH_Msk & ((value) << DWT_FUNCTION3_CYCMATCH_Pos))
#define DWT_FUNCTION3_DATAVMATCH_Pos          _U_(8)                                               /**< (DWT_FUNCTION3)  Position */
#define DWT_FUNCTION3_DATAVMATCH_Msk          (_U_(0x1) << DWT_FUNCTION3_DATAVMATCH_Pos)           /**< (DWT_FUNCTION3)  Mask */
#define DWT_FUNCTION3_DATAVMATCH(value)       (DWT_FUNCTION3_DATAVMATCH_Msk & ((value) << DWT_FUNCTION3_DATAVMATCH_Pos))
#define DWT_FUNCTION3_LNK1ENA_Pos             _U_(9)                                               /**< (DWT_FUNCTION3)  Position */
#define DWT_FUNCTION3_LNK1ENA_Msk             (_U_(0x1) << DWT_FUNCTION3_LNK1ENA_Pos)              /**< (DWT_FUNCTION3)  Mask */
#define DWT_FUNCTION3_LNK1ENA(value)          (DWT_FUNCTION3_LNK1ENA_Msk & ((value) << DWT_FUNCTION3_LNK1ENA_Pos))
#define DWT_FUNCTION3_DATAVSIZE_Pos           _U_(10)                                              /**< (DWT_FUNCTION3)  Position */
#define DWT_FUNCTION3_DATAVSIZE_Msk           (_U_(0x3) << DWT_FUNCTION3_DATAVSIZE_Pos)            /**< (DWT_FUNCTION3)  Mask */
#define DWT_FUNCTION3_DATAVSIZE(value)        (DWT_FUNCTION3_DATAVSIZE_Msk & ((value) << DWT_FUNCTION3_DATAVSIZE_Pos))
#define DWT_FUNCTION3_DATAVADDR0_Pos          _U_(12)                                              /**< (DWT_FUNCTION3)  Position */
#define DWT_FUNCTION3_DATAVADDR0_Msk          (_U_(0xF) << DWT_FUNCTION3_DATAVADDR0_Pos)           /**< (DWT_FUNCTION3)  Mask */
#define DWT_FUNCTION3_DATAVADDR0(value)       (DWT_FUNCTION3_DATAVADDR0_Msk & ((value) << DWT_FUNCTION3_DATAVADDR0_Pos))
#define DWT_FUNCTION3_DATAVADDR1_Pos          _U_(16)                                              /**< (DWT_FUNCTION3)  Position */
#define DWT_FUNCTION3_DATAVADDR1_Msk          (_U_(0xF) << DWT_FUNCTION3_DATAVADDR1_Pos)           /**< (DWT_FUNCTION3)  Mask */
#define DWT_FUNCTION3_DATAVADDR1(value)       (DWT_FUNCTION3_DATAVADDR1_Msk & ((value) << DWT_FUNCTION3_DATAVADDR1_Pos))
#define DWT_FUNCTION3_MATCHED_Pos             _U_(24)                                              /**< (DWT_FUNCTION3)  Position */
#define DWT_FUNCTION3_MATCHED_Msk             (_U_(0x1) << DWT_FUNCTION3_MATCHED_Pos)              /**< (DWT_FUNCTION3)  Mask */
#define DWT_FUNCTION3_MATCHED(value)          (DWT_FUNCTION3_MATCHED_Msk & ((value) << DWT_FUNCTION3_MATCHED_Pos))
#define DWT_FUNCTION3_Msk                     _U_(0x010FFFAF)                                      /**< (DWT_FUNCTION3) Register Mask  */


/** \brief DWT register offsets definitions */
#define DWT_CTRL_REG_OFST              (0x00)              /**< (DWT_CTRL) Control Register Offset */
#define DWT_CYCCNT_REG_OFST            (0x04)              /**< (DWT_CYCCNT) Cycle Count Register Offset */
#define DWT_CPICNT_REG_OFST            (0x08)              /**< (DWT_CPICNT) CPI Count Register Offset */
#define DWT_EXCCNT_REG_OFST            (0x0C)              /**< (DWT_EXCCNT) Exception Overhead Count Register Offset */
#define DWT_SLEEPCNT_REG_OFST          (0x10)              /**< (DWT_SLEEPCNT) Sleep Count Register Offset */
#define DWT_LSUCNT_REG_OFST            (0x14)              /**< (DWT_LSUCNT) LSU Count Register Offset */
#define DWT_FOLDCNT_REG_OFST           (0x18)              /**< (DWT_FOLDCNT) Folded-instruction Count Register Offset */
#define DWT_PCSR_REG_OFST              (0x1C)              /**< (DWT_PCSR) Program Counter Sample Register Offset */
#define DWT_COMP0_REG_OFST             (0x20)              /**< (DWT_COMP0) Comparator Register 0 Offset */
#define DWT_MASK0_REG_OFST             (0x24)              /**< (DWT_MASK0) Mask Register 0 Offset */
#define DWT_FUNCTION0_REG_OFST         (0x28)              /**< (DWT_FUNCTION0) Function Register 0 Offset */
#define DWT_COMP1_REG_OFST             (0x30)              /**< (DWT_COMP1) Comparator Register 1 Offset */
#define DWT_MASK1_REG_OFST             (0x34)              /**< (DWT_MASK1) Mask Register 1 Offset */
#define DWT_FUNCTION1_REG_OFST         (0x38)              /**< (DWT_FUNCTION1) Function Register 1 Offset */
#define DWT_COMP2_REG_OFST             (0x40)              /**< (DWT_COMP2) Comparator Register 2 Offset */
#define DWT_MASK2_REG_OFST             (0x44)              /**< (DWT_MASK2) Mask Register 2 Offset */
#define DWT_FUNCTION2_REG_OFST         (0x48)              /**< (DWT_FUNCTION2) Function Register 2 Offset */
#define DWT_COMP3_REG_OFST             (0x50)              /**< (DWT_COMP3) Comparator Register 3 Offset */
#define DWT_MASK3_REG_OFST             (0x54)              /**< (DWT_MASK3) Mask Register 3 Offset */
#define DWT_FUNCTION3_REG_OFST         (0x58)              /**< (DWT_FUNCTION3) Function Register 3 Offset */

