Microchip-MPLAB-Harmony/csp/apps/sercom/spi/spi_self_loopback_interrupt/firmware/src/packs/ATSAME54P20A_DFP/component/dwt.h
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief DWT register API structure */
typedef struct
{  /* Data Watchpoint and Trace Register */
  __IO  uint32_t                       DWT_CTRL;           /**< Offset: 0x00 (R/W  32) Control Register */
  __IO  uint32_t                       DWT_CYCCNT;         /**< Offset: 0x04 (R/W  32) Cycle Count Register */
  __IO  uint32_t                       DWT_CPICNT;         /**< Offset: 0x08 (R/W  32) CPI Count Register */
  __IO  uint32_t                       DWT_EXCCNT;         /**< Offset: 0x0C (R/W  32) Exception Overhead Count Register */
  __IO  uint32_t                       DWT_SLEEPCNT;       /**< Offset: 0x10 (R/W  32) Sleep Count Register */
  __IO  uint32_t                       DWT_LSUCNT;         /**< Offset: 0x14 (R/W  32) LSU Count Register */
  __IO  uint32_t                       DWT_FOLDCNT;        /**< Offset: 0x18 (R/W  32) Folded-instruction Count Register */
  __I   uint32_t                       DWT_PCSR;           /**< Offset: 0x1C (R/   32) Program Counter Sample Register */
  __IO  uint32_t                       DWT_COMP0;          /**< Offset: 0x20 (R/W  32) Comparator Register 0 */
  __IO  uint32_t                       DWT_MASK0;          /**< Offset: 0x24 (R/W  32) Mask Register 0 */
  __IO  uint32_t                       DWT_FUNCTION0;      /**< Offset: 0x28 (R/W  32) Function Register 0 */
  __I   uint8_t                        Reserved1[0x04];
  __IO  uint32_t                       DWT_COMP1;          /**< Offset: 0x30 (R/W  32) Comparator Register 1 */
  __IO  uint32_t                       DWT_MASK1;          /**< Offset: 0x34 (R/W  32) Mask Register 1 */
  __IO  uint32_t                       DWT_FUNCTION1;      /**< Offset: 0x38 (R/W  32) Function Register 1 */
  __I   uint8_t                        Reserved2[0x04];
  __IO  uint32_t                       DWT_COMP2;          /**< Offset: 0x40 (R/W  32) Comparator Register 2 */
  __IO  uint32_t                       DWT_MASK2;          /**< Offset: 0x44 (R/W  32) Mask Register 2 */
  __IO  uint32_t                       DWT_FUNCTION2;      /**< Offset: 0x48 (R/W  32) Function Register 2 */
  __I   uint8_t                        Reserved3[0x04];
  __IO  uint32_t                       DWT_COMP3;          /**< Offset: 0x50 (R/W  32) Comparator Register 3 */
  __IO  uint32_t                       DWT_MASK3;          /**< Offset: 0x54 (R/W  32) Mask Register 3 */
  __IO  uint32_t                       DWT_FUNCTION3;      /**< Offset: 0x58 (R/W  32) Function Register 3 */
} dwt_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _SAME54_DWT_COMPONENT_H_ */
